app/lib/tasks/scrape.rake

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "price", "availability", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "A Light in the Attic"], ["price", 51.77], ["availability", "In stock"], ["rating", 3], ["created_at", "2023-11-21 22:55:48.266017"], ["updated_at", "2023-11-21 22:55:48.266017"]]
---
=end
    Book.delete_all # for testing
    csv = CSV.parse(File.read('books.csv'), headers: true)
    csv.each do |row|
      Book.create!(row.to_hash)